layer {  
  
  name: "data"  
  type: "Input"  
  top: "data"  
  input_param { shape: { dim: 10 dim: 3 dim: 224 dim: 224 } }  
}
layer {
  name: "caffe.SpatialConvolution_0"
  type: "Convolution"
  bottom: "data"
  top: "caffe.SpatialConvolution_0"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 3
    pad_w: 3
    kernel_h: 7
    kernel_w: 7
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_1_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_0"
  top: "caffe.BN_1_bn"
}
layer {
  name: "caffe.BN_1_scale"
  type: "Scale"
  bottom: "caffe.BN_1_bn"
  top: "caffe.BN_1"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_2"
  type: "ReLU"
  bottom: "caffe.BN_1"
  top: "caffe.BN_1"
}
layer {
  name: "caffe.Pooling_3"
  type: "Pooling"
  bottom: "caffe.BN_1"
  top: "caffe.Pooling_3"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "caffe.SpatialConvolution_4"
  type: "Convolution"
  bottom: "caffe.Pooling_3"
  top: "caffe.SpatialConvolution_4"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_5_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_4"
  top: "caffe.BN_5_bn"
}
layer {
  name: "caffe.BN_5_scale"
  type: "Scale"
  bottom: "caffe.BN_5_bn"
  top: "caffe.BN_5"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_6"
  type: "ReLU"
  bottom: "caffe.BN_5"
  top: "caffe.BN_5"
}
layer {
  name: "caffe.SpatialConvolution_7"
  type: "Convolution"
  bottom: "caffe.BN_5"
  top: "caffe.SpatialConvolution_7"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_8_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_7"
  top: "caffe.BN_8_bn"
}
layer {
  name: "caffe.BN_8_scale"
  type: "Scale"
  bottom: "caffe.BN_8_bn"
  top: "caffe.BN_8"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_9"
  type: "ReLU"
  bottom: "caffe.BN_8"
  top: "caffe.BN_8"
}
layer {
  name: "caffe.SpatialConvolution_10"
  type: "Convolution"
  bottom: "caffe.BN_8"
  top: "caffe.SpatialConvolution_10"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_11_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_10"
  top: "caffe.BN_11_bn"
}
layer {
  name: "caffe.BN_11_scale"
  type: "Scale"
  bottom: "caffe.BN_11_bn"
  top: "caffe.BN_11"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.SpatialConvolution_12"
  type: "Convolution"
  bottom: "caffe.Pooling_3"
  top: "caffe.SpatialConvolution_12"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_13_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_12"
  top: "caffe.BN_13_bn"
}
layer {
  name: "caffe.BN_13_scale"
  type: "Scale"
  bottom: "caffe.BN_13_bn"
  top: "caffe.BN_13"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_14"
  type: "Eltwise"
  bottom: "caffe.BN_11"
  bottom: "caffe.BN_13"
  top: "caffe.Eltwise_14"
}
layer {
  name: "caffe.ReLU_15"
  type: "ReLU"
  bottom: "caffe.Eltwise_14"
  top: "caffe.Eltwise_14"
}
layer {
  name: "caffe.SpatialConvolution_16"
  type: "Convolution"
  bottom: "caffe.Eltwise_14"
  top: "caffe.SpatialConvolution_16"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_17_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_16"
  top: "caffe.BN_17_bn"
}
layer {
  name: "caffe.BN_17_scale"
  type: "Scale"
  bottom: "caffe.BN_17_bn"
  top: "caffe.BN_17"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_18"
  type: "ReLU"
  bottom: "caffe.BN_17"
  top: "caffe.BN_17"
}
layer {
  name: "caffe.SpatialConvolution_19"
  type: "Convolution"
  bottom: "caffe.BN_17"
  top: "caffe.SpatialConvolution_19"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_20_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_19"
  top: "caffe.BN_20_bn"
}
layer {
  name: "caffe.BN_20_scale"
  type: "Scale"
  bottom: "caffe.BN_20_bn"
  top: "caffe.BN_20"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_21"
  type: "ReLU"
  bottom: "caffe.BN_20"
  top: "caffe.BN_20"
}
layer {
  name: "caffe.SpatialConvolution_22"
  type: "Convolution"
  bottom: "caffe.BN_20"
  top: "caffe.SpatialConvolution_22"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_23_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_22"
  top: "caffe.BN_23_bn"
}
layer {
  name: "caffe.BN_23_scale"
  type: "Scale"
  bottom: "caffe.BN_23_bn"
  top: "caffe.BN_23"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_24"
  type: "Eltwise"
  bottom: "caffe.BN_23"
  bottom: "caffe.Eltwise_14"
  top: "caffe.Eltwise_24"
}
layer {
  name: "caffe.ReLU_25"
  type: "ReLU"
  bottom: "caffe.Eltwise_24"
  top: "caffe.Eltwise_24"
}
layer {
  name: "caffe.SpatialConvolution_26"
  type: "Convolution"
  bottom: "caffe.Eltwise_24"
  top: "caffe.SpatialConvolution_26"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_27_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_26"
  top: "caffe.BN_27_bn"
}
layer {
  name: "caffe.BN_27_scale"
  type: "Scale"
  bottom: "caffe.BN_27_bn"
  top: "caffe.BN_27"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_28"
  type: "ReLU"
  bottom: "caffe.BN_27"
  top: "caffe.BN_27"
}
layer {
  name: "caffe.SpatialConvolution_29"
  type: "Convolution"
  bottom: "caffe.BN_27"
  top: "caffe.SpatialConvolution_29"
  convolution_param {
    num_output: 64
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_30_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_29"
  top: "caffe.BN_30_bn"
}
layer {
  name: "caffe.BN_30_scale"
  type: "Scale"
  bottom: "caffe.BN_30_bn"
  top: "caffe.BN_30"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_31"
  type: "ReLU"
  bottom: "caffe.BN_30"
  top: "caffe.BN_30"
}
layer {
  name: "caffe.SpatialConvolution_32"
  type: "Convolution"
  bottom: "caffe.BN_30"
  top: "caffe.SpatialConvolution_32"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_33_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_32"
  top: "caffe.BN_33_bn"
}
layer {
  name: "caffe.BN_33_scale"
  type: "Scale"
  bottom: "caffe.BN_33_bn"
  top: "caffe.BN_33"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_34"
  type: "Eltwise"
  bottom: "caffe.BN_33"
  bottom: "caffe.Eltwise_24"
  top: "caffe.Eltwise_34"
}
layer {
  name: "caffe.ReLU_35"
  type: "ReLU"
  bottom: "caffe.Eltwise_34"
  top: "caffe.Eltwise_34"
}
layer {
  name: "caffe.SpatialConvolution_36"
  type: "Convolution"
  bottom: "caffe.Eltwise_34"
  top: "caffe.SpatialConvolution_36"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_37_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_36"
  top: "caffe.BN_37_bn"
}
layer {
  name: "caffe.BN_37_scale"
  type: "Scale"
  bottom: "caffe.BN_37_bn"
  top: "caffe.BN_37"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_38"
  type: "ReLU"
  bottom: "caffe.BN_37"
  top: "caffe.BN_37"
}
layer {
  name: "caffe.SpatialConvolution_39"
  type: "Convolution"
  bottom: "caffe.BN_37"
  top: "caffe.SpatialConvolution_39"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_40_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_39"
  top: "caffe.BN_40_bn"
}
layer {
  name: "caffe.BN_40_scale"
  type: "Scale"
  bottom: "caffe.BN_40_bn"
  top: "caffe.BN_40"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_41"
  type: "ReLU"
  bottom: "caffe.BN_40"
  top: "caffe.BN_40"
}
layer {
  name: "caffe.SpatialConvolution_42"
  type: "Convolution"
  bottom: "caffe.BN_40"
  top: "caffe.SpatialConvolution_42"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_43_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_42"
  top: "caffe.BN_43_bn"
}
layer {
  name: "caffe.BN_43_scale"
  type: "Scale"
  bottom: "caffe.BN_43_bn"
  top: "caffe.BN_43"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.SpatialConvolution_44"
  type: "Convolution"
  bottom: "caffe.Eltwise_34"
  top: "caffe.SpatialConvolution_44"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_45_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_44"
  top: "caffe.BN_45_bn"
}
layer {
  name: "caffe.BN_45_scale"
  type: "Scale"
  bottom: "caffe.BN_45_bn"
  top: "caffe.BN_45"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_46"
  type: "Eltwise"
  bottom: "caffe.BN_43"
  bottom: "caffe.BN_45"
  top: "caffe.Eltwise_46"
}
layer {
  name: "caffe.ReLU_47"
  type: "ReLU"
  bottom: "caffe.Eltwise_46"
  top: "caffe.Eltwise_46"
}
layer {
  name: "caffe.SpatialConvolution_48"
  type: "Convolution"
  bottom: "caffe.Eltwise_46"
  top: "caffe.SpatialConvolution_48"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_49_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_48"
  top: "caffe.BN_49_bn"
}
layer {
  name: "caffe.BN_49_scale"
  type: "Scale"
  bottom: "caffe.BN_49_bn"
  top: "caffe.BN_49"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_50"
  type: "ReLU"
  bottom: "caffe.BN_49"
  top: "caffe.BN_49"
}
layer {
  name: "caffe.SpatialConvolution_51"
  type: "Convolution"
  bottom: "caffe.BN_49"
  top: "caffe.SpatialConvolution_51"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_52_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_51"
  top: "caffe.BN_52_bn"
}
layer {
  name: "caffe.BN_52_scale"
  type: "Scale"
  bottom: "caffe.BN_52_bn"
  top: "caffe.BN_52"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_53"
  type: "ReLU"
  bottom: "caffe.BN_52"
  top: "caffe.BN_52"
}
layer {
  name: "caffe.SpatialConvolution_54"
  type: "Convolution"
  bottom: "caffe.BN_52"
  top: "caffe.SpatialConvolution_54"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_55_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_54"
  top: "caffe.BN_55_bn"
}
layer {
  name: "caffe.BN_55_scale"
  type: "Scale"
  bottom: "caffe.BN_55_bn"
  top: "caffe.BN_55"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_56"
  type: "Eltwise"
  bottom: "caffe.BN_55"
  bottom: "caffe.Eltwise_46"
  top: "caffe.Eltwise_56"
}
layer {
  name: "caffe.ReLU_57"
  type: "ReLU"
  bottom: "caffe.Eltwise_56"
  top: "caffe.Eltwise_56"
}
layer {
  name: "caffe.SpatialConvolution_58"
  type: "Convolution"
  bottom: "caffe.Eltwise_56"
  top: "caffe.SpatialConvolution_58"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_59_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_58"
  top: "caffe.BN_59_bn"
}
layer {
  name: "caffe.BN_59_scale"
  type: "Scale"
  bottom: "caffe.BN_59_bn"
  top: "caffe.BN_59"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_60"
  type: "ReLU"
  bottom: "caffe.BN_59"
  top: "caffe.BN_59"
}
layer {
  name: "caffe.SpatialConvolution_61"
  type: "Convolution"
  bottom: "caffe.BN_59"
  top: "caffe.SpatialConvolution_61"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_62_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_61"
  top: "caffe.BN_62_bn"
}
layer {
  name: "caffe.BN_62_scale"
  type: "Scale"
  bottom: "caffe.BN_62_bn"
  top: "caffe.BN_62"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_63"
  type: "ReLU"
  bottom: "caffe.BN_62"
  top: "caffe.BN_62"
}
layer {
  name: "caffe.SpatialConvolution_64"
  type: "Convolution"
  bottom: "caffe.BN_62"
  top: "caffe.SpatialConvolution_64"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_65_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_64"
  top: "caffe.BN_65_bn"
}
layer {
  name: "caffe.BN_65_scale"
  type: "Scale"
  bottom: "caffe.BN_65_bn"
  top: "caffe.BN_65"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_66"
  type: "Eltwise"
  bottom: "caffe.BN_65"
  bottom: "caffe.Eltwise_56"
  top: "caffe.Eltwise_66"
}
layer {
  name: "caffe.ReLU_67"
  type: "ReLU"
  bottom: "caffe.Eltwise_66"
  top: "caffe.Eltwise_66"
}
layer {
  name: "caffe.SpatialConvolution_68"
  type: "Convolution"
  bottom: "caffe.Eltwise_66"
  top: "caffe.SpatialConvolution_68"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_69_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_68"
  top: "caffe.BN_69_bn"
}
layer {
  name: "caffe.BN_69_scale"
  type: "Scale"
  bottom: "caffe.BN_69_bn"
  top: "caffe.BN_69"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_70"
  type: "ReLU"
  bottom: "caffe.BN_69"
  top: "caffe.BN_69"
}
layer {
  name: "caffe.SpatialConvolution_71"
  type: "Convolution"
  bottom: "caffe.BN_69"
  top: "caffe.SpatialConvolution_71"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_72_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_71"
  top: "caffe.BN_72_bn"
}
layer {
  name: "caffe.BN_72_scale"
  type: "Scale"
  bottom: "caffe.BN_72_bn"
  top: "caffe.BN_72"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_73"
  type: "ReLU"
  bottom: "caffe.BN_72"
  top: "caffe.BN_72"
}
layer {
  name: "caffe.SpatialConvolution_74"
  type: "Convolution"
  bottom: "caffe.BN_72"
  top: "caffe.SpatialConvolution_74"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_75_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_74"
  top: "caffe.BN_75_bn"
}
layer {
  name: "caffe.BN_75_scale"
  type: "Scale"
  bottom: "caffe.BN_75_bn"
  top: "caffe.BN_75"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_76"
  type: "Eltwise"
  bottom: "caffe.BN_75"
  bottom: "caffe.Eltwise_66"
  top: "caffe.Eltwise_76"
}
layer {
  name: "caffe.ReLU_77"
  type: "ReLU"
  bottom: "caffe.Eltwise_76"
  top: "caffe.Eltwise_76"
}
layer {
  name: "caffe.SpatialConvolution_78"
  type: "Convolution"
  bottom: "caffe.Eltwise_76"
  top: "caffe.SpatialConvolution_78"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_79_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_78"
  top: "caffe.BN_79_bn"
}
layer {
  name: "caffe.BN_79_scale"
  type: "Scale"
  bottom: "caffe.BN_79_bn"
  top: "caffe.BN_79"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_80"
  type: "ReLU"
  bottom: "caffe.BN_79"
  top: "caffe.BN_79"
}
layer {
  name: "caffe.SpatialConvolution_81"
  type: "Convolution"
  bottom: "caffe.BN_79"
  top: "caffe.SpatialConvolution_81"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_82_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_81"
  top: "caffe.BN_82_bn"
}
layer {
  name: "caffe.BN_82_scale"
  type: "Scale"
  bottom: "caffe.BN_82_bn"
  top: "caffe.BN_82"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_83"
  type: "ReLU"
  bottom: "caffe.BN_82"
  top: "caffe.BN_82"
}
layer {
  name: "caffe.SpatialConvolution_84"
  type: "Convolution"
  bottom: "caffe.BN_82"
  top: "caffe.SpatialConvolution_84"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_85_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_84"
  top: "caffe.BN_85_bn"
}
layer {
  name: "caffe.BN_85_scale"
  type: "Scale"
  bottom: "caffe.BN_85_bn"
  top: "caffe.BN_85"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_86"
  type: "Eltwise"
  bottom: "caffe.BN_85"
  bottom: "caffe.Eltwise_76"
  top: "caffe.Eltwise_86"
}
layer {
  name: "caffe.ReLU_87"
  type: "ReLU"
  bottom: "caffe.Eltwise_86"
  top: "caffe.Eltwise_86"
}
layer {
  name: "caffe.SpatialConvolution_88"
  type: "Convolution"
  bottom: "caffe.Eltwise_86"
  top: "caffe.SpatialConvolution_88"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_89_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_88"
  top: "caffe.BN_89_bn"
}
layer {
  name: "caffe.BN_89_scale"
  type: "Scale"
  bottom: "caffe.BN_89_bn"
  top: "caffe.BN_89"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_90"
  type: "ReLU"
  bottom: "caffe.BN_89"
  top: "caffe.BN_89"
}
layer {
  name: "caffe.SpatialConvolution_91"
  type: "Convolution"
  bottom: "caffe.BN_89"
  top: "caffe.SpatialConvolution_91"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_92_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_91"
  top: "caffe.BN_92_bn"
}
layer {
  name: "caffe.BN_92_scale"
  type: "Scale"
  bottom: "caffe.BN_92_bn"
  top: "caffe.BN_92"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_93"
  type: "ReLU"
  bottom: "caffe.BN_92"
  top: "caffe.BN_92"
}
layer {
  name: "caffe.SpatialConvolution_94"
  type: "Convolution"
  bottom: "caffe.BN_92"
  top: "caffe.SpatialConvolution_94"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_95_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_94"
  top: "caffe.BN_95_bn"
}
layer {
  name: "caffe.BN_95_scale"
  type: "Scale"
  bottom: "caffe.BN_95_bn"
  top: "caffe.BN_95"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_96"
  type: "Eltwise"
  bottom: "caffe.BN_95"
  bottom: "caffe.Eltwise_86"
  top: "caffe.Eltwise_96"
}
layer {
  name: "caffe.ReLU_97"
  type: "ReLU"
  bottom: "caffe.Eltwise_96"
  top: "caffe.Eltwise_96"
}
layer {
  name: "caffe.SpatialConvolution_98"
  type: "Convolution"
  bottom: "caffe.Eltwise_96"
  top: "caffe.SpatialConvolution_98"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_99_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_98"
  top: "caffe.BN_99_bn"
}
layer {
  name: "caffe.BN_99_scale"
  type: "Scale"
  bottom: "caffe.BN_99_bn"
  top: "caffe.BN_99"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_100"
  type: "ReLU"
  bottom: "caffe.BN_99"
  top: "caffe.BN_99"
}
layer {
  name: "caffe.SpatialConvolution_101"
  type: "Convolution"
  bottom: "caffe.BN_99"
  top: "caffe.SpatialConvolution_101"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_102_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_101"
  top: "caffe.BN_102_bn"
}
layer {
  name: "caffe.BN_102_scale"
  type: "Scale"
  bottom: "caffe.BN_102_bn"
  top: "caffe.BN_102"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_103"
  type: "ReLU"
  bottom: "caffe.BN_102"
  top: "caffe.BN_102"
}
layer {
  name: "caffe.SpatialConvolution_104"
  type: "Convolution"
  bottom: "caffe.BN_102"
  top: "caffe.SpatialConvolution_104"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_105_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_104"
  top: "caffe.BN_105_bn"
}
layer {
  name: "caffe.BN_105_scale"
  type: "Scale"
  bottom: "caffe.BN_105_bn"
  top: "caffe.BN_105"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_106"
  type: "Eltwise"
  bottom: "caffe.BN_105"
  bottom: "caffe.Eltwise_96"
  top: "caffe.Eltwise_106"
}
layer {
  name: "caffe.ReLU_107"
  type: "ReLU"
  bottom: "caffe.Eltwise_106"
  top: "caffe.Eltwise_106"
}
layer {
  name: "caffe.SpatialConvolution_108"
  type: "Convolution"
  bottom: "caffe.Eltwise_106"
  top: "caffe.SpatialConvolution_108"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_109_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_108"
  top: "caffe.BN_109_bn"
}
layer {
  name: "caffe.BN_109_scale"
  type: "Scale"
  bottom: "caffe.BN_109_bn"
  top: "caffe.BN_109"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_110"
  type: "ReLU"
  bottom: "caffe.BN_109"
  top: "caffe.BN_109"
}
layer {
  name: "caffe.SpatialConvolution_111"
  type: "Convolution"
  bottom: "caffe.BN_109"
  top: "caffe.SpatialConvolution_111"
  convolution_param {
    num_output: 128
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_112_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_111"
  top: "caffe.BN_112_bn"
}
layer {
  name: "caffe.BN_112_scale"
  type: "Scale"
  bottom: "caffe.BN_112_bn"
  top: "caffe.BN_112"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_113"
  type: "ReLU"
  bottom: "caffe.BN_112"
  top: "caffe.BN_112"
}
layer {
  name: "caffe.SpatialConvolution_114"
  type: "Convolution"
  bottom: "caffe.BN_112"
  top: "caffe.SpatialConvolution_114"
  convolution_param {
    num_output: 512
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_115_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_114"
  top: "caffe.BN_115_bn"
}
layer {
  name: "caffe.BN_115_scale"
  type: "Scale"
  bottom: "caffe.BN_115_bn"
  top: "caffe.BN_115"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_116"
  type: "Eltwise"
  bottom: "caffe.BN_115"
  bottom: "caffe.Eltwise_106"
  top: "caffe.Eltwise_116"
}
layer {
  name: "caffe.ReLU_117"
  type: "ReLU"
  bottom: "caffe.Eltwise_116"
  top: "caffe.Eltwise_116"
}
layer {
  name: "caffe.SpatialConvolution_118"
  type: "Convolution"
  bottom: "caffe.Eltwise_116"
  top: "caffe.SpatialConvolution_118"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_119_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_118"
  top: "caffe.BN_119_bn"
}
layer {
  name: "caffe.BN_119_scale"
  type: "Scale"
  bottom: "caffe.BN_119_bn"
  top: "caffe.BN_119"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_120"
  type: "ReLU"
  bottom: "caffe.BN_119"
  top: "caffe.BN_119"
}
layer {
  name: "caffe.SpatialConvolution_121"
  type: "Convolution"
  bottom: "caffe.BN_119"
  top: "caffe.SpatialConvolution_121"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_122_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_121"
  top: "caffe.BN_122_bn"
}
layer {
  name: "caffe.BN_122_scale"
  type: "Scale"
  bottom: "caffe.BN_122_bn"
  top: "caffe.BN_122"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_123"
  type: "ReLU"
  bottom: "caffe.BN_122"
  top: "caffe.BN_122"
}
layer {
  name: "caffe.SpatialConvolution_124"
  type: "Convolution"
  bottom: "caffe.BN_122"
  top: "caffe.SpatialConvolution_124"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_125_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_124"
  top: "caffe.BN_125_bn"
}
layer {
  name: "caffe.BN_125_scale"
  type: "Scale"
  bottom: "caffe.BN_125_bn"
  top: "caffe.BN_125"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.SpatialConvolution_126"
  type: "Convolution"
  bottom: "caffe.Eltwise_116"
  top: "caffe.SpatialConvolution_126"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "caffe.BN_127_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_126"
  top: "caffe.BN_127_bn"
}
layer {
  name: "caffe.BN_127_scale"
  type: "Scale"
  bottom: "caffe.BN_127_bn"
  top: "caffe.BN_127"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_128"
  type: "Eltwise"
  bottom: "caffe.BN_125"
  bottom: "caffe.BN_127"
  top: "caffe.Eltwise_128"
}
layer {
  name: "caffe.ReLU_129"
  type: "ReLU"
  bottom: "caffe.Eltwise_128"
  top: "caffe.Eltwise_128"
}
layer {
  name: "caffe.SpatialConvolution_130"
  type: "Convolution"
  bottom: "caffe.Eltwise_128"
  top: "caffe.SpatialConvolution_130"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_131_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_130"
  top: "caffe.BN_131_bn"
}
layer {
  name: "caffe.BN_131_scale"
  type: "Scale"
  bottom: "caffe.BN_131_bn"
  top: "caffe.BN_131"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_132"
  type: "ReLU"
  bottom: "caffe.BN_131"
  top: "caffe.BN_131"
}
layer {
  name: "caffe.SpatialConvolution_133"
  type: "Convolution"
  bottom: "caffe.BN_131"
  top: "caffe.SpatialConvolution_133"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_134_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_133"
  top: "caffe.BN_134_bn"
}
layer {
  name: "caffe.BN_134_scale"
  type: "Scale"
  bottom: "caffe.BN_134_bn"
  top: "caffe.BN_134"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_135"
  type: "ReLU"
  bottom: "caffe.BN_134"
  top: "caffe.BN_134"
}
layer {
  name: "caffe.SpatialConvolution_136"
  type: "Convolution"
  bottom: "caffe.BN_134"
  top: "caffe.SpatialConvolution_136"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_137_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_136"
  top: "caffe.BN_137_bn"
}
layer {
  name: "caffe.BN_137_scale"
  type: "Scale"
  bottom: "caffe.BN_137_bn"
  top: "caffe.BN_137"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_138"
  type: "Eltwise"
  bottom: "caffe.BN_137"
  bottom: "caffe.Eltwise_128"
  top: "caffe.Eltwise_138"
}
layer {
  name: "caffe.ReLU_139"
  type: "ReLU"
  bottom: "caffe.Eltwise_138"
  top: "caffe.Eltwise_138"
}
layer {
  name: "caffe.SpatialConvolution_140"
  type: "Convolution"
  bottom: "caffe.Eltwise_138"
  top: "caffe.SpatialConvolution_140"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_141_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_140"
  top: "caffe.BN_141_bn"
}
layer {
  name: "caffe.BN_141_scale"
  type: "Scale"
  bottom: "caffe.BN_141_bn"
  top: "caffe.BN_141"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_142"
  type: "ReLU"
  bottom: "caffe.BN_141"
  top: "caffe.BN_141"
}
layer {
  name: "caffe.SpatialConvolution_143"
  type: "Convolution"
  bottom: "caffe.BN_141"
  top: "caffe.SpatialConvolution_143"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_144_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_143"
  top: "caffe.BN_144_bn"
}
layer {
  name: "caffe.BN_144_scale"
  type: "Scale"
  bottom: "caffe.BN_144_bn"
  top: "caffe.BN_144"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_145"
  type: "ReLU"
  bottom: "caffe.BN_144"
  top: "caffe.BN_144"
}
layer {
  name: "caffe.SpatialConvolution_146"
  type: "Convolution"
  bottom: "caffe.BN_144"
  top: "caffe.SpatialConvolution_146"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_147_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_146"
  top: "caffe.BN_147_bn"
}
layer {
  name: "caffe.BN_147_scale"
  type: "Scale"
  bottom: "caffe.BN_147_bn"
  top: "caffe.BN_147"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_148"
  type: "Eltwise"
  bottom: "caffe.BN_147"
  bottom: "caffe.Eltwise_138"
  top: "caffe.Eltwise_148"
}
layer {
  name: "caffe.ReLU_149"
  type: "ReLU"
  bottom: "caffe.Eltwise_148"
  top: "caffe.Eltwise_148"
}
layer {
  name: "caffe.SpatialConvolution_150"
  type: "Convolution"
  bottom: "caffe.Eltwise_148"
  top: "caffe.SpatialConvolution_150"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_151_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_150"
  top: "caffe.BN_151_bn"
}
layer {
  name: "caffe.BN_151_scale"
  type: "Scale"
  bottom: "caffe.BN_151_bn"
  top: "caffe.BN_151"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_152"
  type: "ReLU"
  bottom: "caffe.BN_151"
  top: "caffe.BN_151"
}
layer {
  name: "caffe.SpatialConvolution_153"
  type: "Convolution"
  bottom: "caffe.BN_151"
  top: "caffe.SpatialConvolution_153"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_154_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_153"
  top: "caffe.BN_154_bn"
}
layer {
  name: "caffe.BN_154_scale"
  type: "Scale"
  bottom: "caffe.BN_154_bn"
  top: "caffe.BN_154"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_155"
  type: "ReLU"
  bottom: "caffe.BN_154"
  top: "caffe.BN_154"
}
layer {
  name: "caffe.SpatialConvolution_156"
  type: "Convolution"
  bottom: "caffe.BN_154"
  top: "caffe.SpatialConvolution_156"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_157_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_156"
  top: "caffe.BN_157_bn"
}
layer {
  name: "caffe.BN_157_scale"
  type: "Scale"
  bottom: "caffe.BN_157_bn"
  top: "caffe.BN_157"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_158"
  type: "Eltwise"
  bottom: "caffe.BN_157"
  bottom: "caffe.Eltwise_148"
  top: "caffe.Eltwise_158"
}
layer {
  name: "caffe.ReLU_159"
  type: "ReLU"
  bottom: "caffe.Eltwise_158"
  top: "caffe.Eltwise_158"
}
layer {
  name: "caffe.SpatialConvolution_160"
  type: "Convolution"
  bottom: "caffe.Eltwise_158"
  top: "caffe.SpatialConvolution_160"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_161_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_160"
  top: "caffe.BN_161_bn"
}
layer {
  name: "caffe.BN_161_scale"
  type: "Scale"
  bottom: "caffe.BN_161_bn"
  top: "caffe.BN_161"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_162"
  type: "ReLU"
  bottom: "caffe.BN_161"
  top: "caffe.BN_161"
}
layer {
  name: "caffe.SpatialConvolution_163"
  type: "Convolution"
  bottom: "caffe.BN_161"
  top: "caffe.SpatialConvolution_163"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_164_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_163"
  top: "caffe.BN_164_bn"
}
layer {
  name: "caffe.BN_164_scale"
  type: "Scale"
  bottom: "caffe.BN_164_bn"
  top: "caffe.BN_164"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_165"
  type: "ReLU"
  bottom: "caffe.BN_164"
  top: "caffe.BN_164"
}
layer {
  name: "caffe.SpatialConvolution_166"
  type: "Convolution"
  bottom: "caffe.BN_164"
  top: "caffe.SpatialConvolution_166"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_167_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_166"
  top: "caffe.BN_167_bn"
}
layer {
  name: "caffe.BN_167_scale"
  type: "Scale"
  bottom: "caffe.BN_167_bn"
  top: "caffe.BN_167"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_168"
  type: "Eltwise"
  bottom: "caffe.BN_167"
  bottom: "caffe.Eltwise_158"
  top: "caffe.Eltwise_168"
}
layer {
  name: "caffe.ReLU_169"
  type: "ReLU"
  bottom: "caffe.Eltwise_168"
  top: "caffe.Eltwise_168"
}
layer {
  name: "caffe.SpatialConvolution_170"
  type: "Convolution"
  bottom: "caffe.Eltwise_168"
  top: "caffe.SpatialConvolution_170"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_171_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_170"
  top: "caffe.BN_171_bn"
}
layer {
  name: "caffe.BN_171_scale"
  type: "Scale"
  bottom: "caffe.BN_171_bn"
  top: "caffe.BN_171"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_172"
  type: "ReLU"
  bottom: "caffe.BN_171"
  top: "caffe.BN_171"
}
layer {
  name: "caffe.SpatialConvolution_173"
  type: "Convolution"
  bottom: "caffe.BN_171"
  top: "caffe.SpatialConvolution_173"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_174_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_173"
  top: "caffe.BN_174_bn"
}
layer {
  name: "caffe.BN_174_scale"
  type: "Scale"
  bottom: "caffe.BN_174_bn"
  top: "caffe.BN_174"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_175"
  type: "ReLU"
  bottom: "caffe.BN_174"
  top: "caffe.BN_174"
}
layer {
  name: "caffe.SpatialConvolution_176"
  type: "Convolution"
  bottom: "caffe.BN_174"
  top: "caffe.SpatialConvolution_176"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_177_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_176"
  top: "caffe.BN_177_bn"
}
layer {
  name: "caffe.BN_177_scale"
  type: "Scale"
  bottom: "caffe.BN_177_bn"
  top: "caffe.BN_177"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_178"
  type: "Eltwise"
  bottom: "caffe.BN_177"
  bottom: "caffe.Eltwise_168"
  top: "caffe.Eltwise_178"
}
layer {
  name: "caffe.ReLU_179"
  type: "ReLU"
  bottom: "caffe.Eltwise_178"
  top: "caffe.Eltwise_178"
}
layer {
  name: "caffe.SpatialConvolution_180"
  type: "Convolution"
  bottom: "caffe.Eltwise_178"
  top: "caffe.SpatialConvolution_180"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_181_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_180"
  top: "caffe.BN_181_bn"
}
layer {
  name: "caffe.BN_181_scale"
  type: "Scale"
  bottom: "caffe.BN_181_bn"
  top: "caffe.BN_181"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_182"
  type: "ReLU"
  bottom: "caffe.BN_181"
  top: "caffe.BN_181"
}
layer {
  name: "caffe.SpatialConvolution_183"
  type: "Convolution"
  bottom: "caffe.BN_181"
  top: "caffe.SpatialConvolution_183"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_184_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_183"
  top: "caffe.BN_184_bn"
}
layer {
  name: "caffe.BN_184_scale"
  type: "Scale"
  bottom: "caffe.BN_184_bn"
  top: "caffe.BN_184"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_185"
  type: "ReLU"
  bottom: "caffe.BN_184"
  top: "caffe.BN_184"
}
layer {
  name: "caffe.SpatialConvolution_186"
  type: "Convolution"
  bottom: "caffe.BN_184"
  top: "caffe.SpatialConvolution_186"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_187_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_186"
  top: "caffe.BN_187_bn"
}
layer {
  name: "caffe.BN_187_scale"
  type: "Scale"
  bottom: "caffe.BN_187_bn"
  top: "caffe.BN_187"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_188"
  type: "Eltwise"
  bottom: "caffe.BN_187"
  bottom: "caffe.Eltwise_178"
  top: "caffe.Eltwise_188"
}
layer {
  name: "caffe.ReLU_189"
  type: "ReLU"
  bottom: "caffe.Eltwise_188"
  top: "caffe.Eltwise_188"
}
layer {
  name: "caffe.SpatialConvolution_190"
  type: "Convolution"
  bottom: "caffe.Eltwise_188"
  top: "caffe.SpatialConvolution_190"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_191_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_190"
  top: "caffe.BN_191_bn"
}
layer {
  name: "caffe.BN_191_scale"
  type: "Scale"
  bottom: "caffe.BN_191_bn"
  top: "caffe.BN_191"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_192"
  type: "ReLU"
  bottom: "caffe.BN_191"
  top: "caffe.BN_191"
}
layer {
  name: "caffe.SpatialConvolution_193"
  type: "Convolution"
  bottom: "caffe.BN_191"
  top: "caffe.SpatialConvolution_193"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_194_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_193"
  top: "caffe.BN_194_bn"
}
layer {
  name: "caffe.BN_194_scale"
  type: "Scale"
  bottom: "caffe.BN_194_bn"
  top: "caffe.BN_194"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.ReLU_195"
  type: "ReLU"
  bottom: "caffe.BN_194"
  top: "caffe.BN_194"
}
layer {
  name: "caffe.SpatialConvolution_196"
  type: "Convolution"
  bottom: "caffe.BN_194"
  top: "caffe.SpatialConvolution_196"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "caffe.BN_197_bn"
  type: "BatchNorm"
  bottom: "caffe.SpatialConvolution_196"
  top: "caffe.BN_197_bn"
}
layer {
  name: "caffe.BN_197_scale"
  type: "Scale"
  bottom: "caffe.BN_197_bn"
  top: "caffe.BN_197"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "caffe.Eltwise_198"
  type: "Eltwise"
  bottom: "caffe.BN_197"
  bottom: "caffe.Eltwise_188"
  top: "caffe.Eltwise_198"
}
layer {
  name: "caffe.ReLU_199"
  type: "ReLU"
  bottom: "caffe.Eltwise_198"
  top: "caffe.Eltwise_198"
}
layer {
  name: "caffe.SpatialConvolution_200"
  type: "Convolution"
  bottom: "caffe.Eltwise_198"
  top: "caffe.SpatialConvolution_200"
  convolution_param {
    num_output: 256
    bias_term: false
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
